<!DOCTYPE HTML>
<html lang="en" >
    
    <head>
        
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>js进阶-第六天 | JS进阶-网页特效</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.6.7">
        
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="gitbook/style.css">
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    
        <link rel="stylesheet" href="./styles/website.css">
    

        
    
    
    
    <link rel="prev" href="./js进阶-第五天.html" />
    

        
    </head>
    <body>
        
        
    <div class="book"
        data-level="6"
        data-chapter-title="js进阶-第六天"
        data-filepath="js进阶-第六天.md"
        data-basepath="."
        data-revision="Tue Dec 20 2016 07:57:49 GMT+0800 (CST)"
        data-innerlanguage="">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
            

            

            
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="./index.html">
                
                        <i class="fa fa-check"></i>
                        
                        JS进阶-开篇
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1" data-path="chapter1.html">
            
                
                    <a href="./chapter1.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        js进阶-第一天
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2" data-path="js进阶-第二天.html">
            
                
                    <a href="./js进阶-第二天.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        js进阶-第二天
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3" data-path="js进阶-第三天.html">
            
                
                    <a href="./js进阶-第三天.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.</b>
                        
                        js进阶-第三天
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="4" data-path="js进阶-第四天.html">
            
                
                    <a href="./js进阶-第四天.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>4.</b>
                        
                        js进阶-第四天
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="5" data-path="js进阶-第五天.html">
            
                
                    <a href="./js进阶-第五天.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>5.</b>
                        
                        js进阶-第五天
                    </a>
            
            
        </li>
    
        <li class="chapter active" data-level="6" data-path="js进阶-第六天.html">
            
                
                    <a href="./js进阶-第六天.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>6.</b>
                        
                        js进阶-第六天
                    </a>
            
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    Published with GitBook
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="./" >JS进阶-网页特效</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h1 id="js&#x7279;&#x6548;--day6">js&#x7279;&#x6548; - Day6</h1>
<h3 id="&#x4E00;&#x3001;&#x95ED;&#x5305;&#x6280;&#x672F;&#x8BE6;&#x89E3;">&#x4E00;&#x3001;&#x95ED;&#x5305;&#x6280;&#x672F;&#x8BE6;&#x89E3;</h3>
<h3 id="11-&#x4EC0;&#x4E48;&#x662F;&#x95ED;&#x5305;&#xFF1F;"><strong>1.1 &#x4EC0;&#x4E48;&#x662F;&#x95ED;&#x5305;&#xFF1F;</strong></h3>
<ul>
<li><p>&#x95ED;&#x5305;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x79CD;&#x51FD;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x95ED;&#x5305;&#x6280;&#x672F;&#x4E5F;&#x662F;&#x51FD;&#x6570;&#x6280;&#x672F;&#x7684;&#x4E00;&#x79CD;&#xFF1B;&#x95ED;&#x5305;&#x80FD;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x51FD;&#x6570;&#x51E0;&#x4E4E;&#x90FD;&#x80FD;&#x505A;&#x3002;</p>
</li>
<li><p>&#x95ED;&#x5305;&#x6280;&#x672F;&#x82B1;&#x5F0F;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x7528;&#x6CD5;&#x4E5F;&#x6BD4;&#x8F83;&#x7075;&#x6D3B;&#xFF0C;&#x4E00;&#x822C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x5B66;&#x4E60;&#x95ED;&#x5305;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x4F1A;&#x9047;&#x5230;&#x74F6;&#x9888;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x56E0;&#x4E3A;&#x95ED;&#x5305;&#x6280;&#x672F;&#x7684;&#x5206;&#x754C;&#x7EBF;&#x5E76;&#x4E0D;&#x660E;&#x663E;&#x3002;&#x51E0;&#x4E4E;&#x65E0;&#x6CD5;&#x7528;&#x4E00;&#x4E2A;&#x7279;&#x70B9;&#x53BB;&#x533A;&#x5206;&#x3002;</p>
</li>
</ul>
<ul>
<li><p>&#x5F53;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x51FD;&#x6570;&#x88AB;&#x5176;&#x5916;&#x90E8;&#x51FD;&#x6570;&#x4E4B;&#x5916;&#x7684;&#x53D8;&#x91CF;&#x5F15;&#x7528;&#x65F6;&#xFF0C;&#x5C31;&#x5F62;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x95ED;&#x5305;&#x3002;</p>
<pre><code>function A(){ 
   function B(){ 
       console.log(&quot;Hello YJH!&quot;);
   } 
   return B; 
} 
var b = A(); 
b();//Hello YJH!
</code></pre></li>
<li><p>&#x95ED;&#x5305;&#x7684;&#x6700;&#x5927;&#x7528;&#x5904;&#x6709;&#x4E24;&#x4E2A;&#xFF1A;&#x4E00;&#x4E2A;&#x662F;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x5C31;&#x662F;&#x8BA9;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x59CB;&#x7EC8;&#x4FDD;&#x6301;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x3002;</p>
<p><img src="assets/144207f8e89e782813.jpg" alt=""></p>
</li>
</ul>
<h3 id="12--&#x5C01;&#x95ED;&#x4F5C;&#x7528;&#x57DF;"><strong>1.2  </strong>&#x5C01;&#x95ED;&#x4F5C;&#x7528;&#x57DF;</h3>
<ul>
<li><p><strong>JavaScript&#x7684;GC&#x673A;&#x5236;</strong></p>
<ul>
<li>&#x5728;javascript&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4E0D;&#x518D;&#x88AB;&#x5F15;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x5C31;&#x4F1A;&#x88AB;GC&#x56DE;&#x6536;&#xFF0C;&#x5426;&#x5219;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x4E00;&#x76F4;&#x4F1A;&#x4FDD;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x3002;</li>
</ul>
</li>
</ul>
<ul>
<li><p><strong>&#x5C01;&#x95ED;&#x4F5C;&#x7528;&#x57DF;</strong></p>
<ul>
<li>&#x5C01;&#x95ED;&#x4F5C;&#x7528;&#x57DF;&#x53C8;&#x79F0;&#x503C;&#x4E3A;&#x5C01;&#x95ED;&#x7A7A;&#x95F4;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x6635;&#x79F0;&#x53EB;&#x5C0F;&#x95ED;&#x5305;&#xFF0C;&#x4EE5;&#x53CA;&#x533F;&#x540D;&#x51FD;&#x6570;&#x81EA;&#x8C03;&#x3002; </li>
<li><p>&#x57FA;&#x672C;&#x7ED3;&#x6784;&#xFF1A;</p>
<pre><code>
(function(){})();
;(function(){})();
+(function(){})();
-(function(){})();
&#xFF1F;(function(){})();
</code></pre></li>
</ul>
</li>
</ul>
<ul>
<li><strong>&#x6280;&#x6CD5;&#x6700;&#x5927;&#x76EE;&#x7684;: &#x5168;&#x5C40;&#x53D8;&#x91CF;&#x79C1;&#x6709;&#x5316; </strong></li>
<li><p><strong>&#x6280;&#x672F;&#x4F18;&#x70B9;&#xFF1A;</strong></p>
<ul>
<li><p>&#x4E0D;&#x6C61;&#x67D3;&#x5168;&#x5C40;&#x7A7A;&#x95F4;&#xFF01;</p>
</li>
<li><p>&#x5185;&#x90E8;&#x6240;&#x6709;&#x7684;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x90FD;&#x4F1A;&#x91CA;&#x653E;&#x4E0D;&#x5360;&#x5185;&#x5B58;&#x3002;</p>
</li>
<li><p>&#x53EF;&#x4EE5;&#x4FDD;&#x5B58;&#x5168;&#x5C40;&#x6570;&#x636E;&#x3002;</p>
</li>
<li><p>&#x66F4;&#x65B0;&#x590D;&#x6742;&#x53D8;&#x91CF;&#x3002;</p>
</li>
</ul>
</li>
</ul>
<h3 id="13--&#x4F5C;&#x7528;&#x57DF;&#x94FE;">1.3  &#x4F5C;&#x7528;&#x57DF;&#x94FE;</h3>
<ul>
<li><p>&#x5D4C;&#x5957;&#x4E4B;&#x95F4;&#x7684;&#x51FD;&#x6570;&#x4F1A;&#x5F62;&#x6210;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#xFF0C;&#x6BCF;&#x6B21;&#x5BF9;&#x53D8;&#x91CF;&#x7684;&#x8BBF;&#x95EE;&#x5B9E;&#x9645;&#x4E0A;&#x90FD;&#x662F;&#x5BF9;&#x6574;&#x6761;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x7684;&#x904D;&#x5386;&#x67E5;&#x627E;&#x3002;&#x5148;&#x67E5;&#x627E;&#x6700;&#x8FD1;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x6700;&#x540E;&#x518D;&#x67E5;&#x627E;&#x5168;&#x5C40;&#x4F5C;&#x7528;&#x57DF;&#x3002;&#x5982;&#x679C;&#x5728;&#x67D0;&#x4E2A;&#x4F5C;&#x7528;&#x57DF;&#x627E;&#x5230;&#x4E86;&#x5BF9;&#x91CF;&#x5C31;&#x4F1A;&#x7ED3;&#x675F;&#x672C;&#x6B21;&#x67E5;&#x627E;&#x8FC7;&#x7A0B;&#x3002;</p>
</li>
<li><p><strong>&#x601D;&#x8003;&#xFF1F;</strong></p>
<ul>
<li><strong>&#x5BF9;&#x4E8E;&#x4F5C;&#x7528;&#x57DF;&#x5168;&#x5C40;&#x4F5C;&#x7528;&#x57DF;&#x67E5;&#x627E;&#x5FEB;&#xFF0C;&#x8FD8;&#x662F;&#x5C40;&#x90E8;&#x4F5C;&#x7528;&#x57DF;&#x67E5;&#x627E;&#x5FEB;&#xFF1F; </strong></li>
<li>&#x5C40;&#x90E8;&#x4F5C;&#x7528;&#x57DF;&#x67E5;&#x627E;&#x8981;&#x8FDC;&#x8FDC;&#x5927;&#x4E8E;&#x5168;&#x5C40;&#x4F5C;&#x7528;&#x57DF;&#x67E5;&#x627E;&#x7684;&#x901F;&#x5EA6;&#x3002;&#x6240;&#x4EE5;&#x9AD8;&#x7EA7;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x4E00;&#x822C;&#x662F;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x5168;&#x5C40;&#x67E5;&#x627E;&#x3002;</li>
<li>&#x6BCF;&#x6B21;&#x8BBF;&#x95EE;&#x90FD;&#x662F;&#x5BF9;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x7684;&#x4E00;&#x6B21;&#x904D;&#x5386;&#x67E5;&#x627E;&#x5176;&#x4E2D;&#x5168;&#x5C40;&#x4F5C;&#x7528;&#x57DF;&#x662F;&#x6700;&#x8017;&#x8D39;&#x65F6;&#x95F4;&#x7684;&#x3002;</li>
</ul>
</li>
</ul>
<ul>
<li><strong>&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF1A;</strong><ul>
<li>&#x5F53;&#x524D;&#x76EE;&#x6807;&#x4F7F;&#x7528;&#x5B8C;&#x4EE5;&#x540E;&#xFF0C;&#x5728;&#x9000;&#x51FA;&#x4F5C;&#x7528;&#x57DF;&#x4E4B;&#x524D;&#x50A8;&#x5B58;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x4E0B;&#x6B21;&#x53D6;&#x5230;&#x4E0A;&#x4E00;&#x6B21;&#x7684;&#x76EE;&#x6807;&#x3002;  </li>
</ul>
</li>
</ul>
<ul>
<li><strong>&#x8865;&#x5145;&#xFF1A;</strong><blockquote>
<p>&#x53D8;&#x91CF;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;
&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x5F15;&#x7528;&#xFF0C;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x662F;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;&#x5468;&#x671F;&#x7ED3;&#x675F;&#x610F;&#x5473;&#x7740;&#x88AB;&#x9500;&#x6BC1;&#x3002; &#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5728;&#x5B83;&#x5F53;&#x524D;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x5185;&#x88AB;&#x58F0;&#x660E;&#x90A3;&#x4E00;&#x523B;&#x76F8;&#x5F53;&#x4E8E;&#x53D8;&#x91CF;&#x51FA;&#x751F;&#xFF0C;&#x6574;&#x4E2A;&#x5F53;&#x524D;&#x4F5C;&#x7528;&#x57DF;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x5E76;&#x9000;&#x51FA;&#x4F5C;&#x7528;&#x57DF;&#x76F8;&#x5F53;&#x4E8E;&#x53D8;&#x91CF;&#x7684;&#x5BFF;&#x547D;&#x7EC8;&#x6B62;&#x3002;</p>
</blockquote>
</li>
</ul>
<h3 id="14-&#x4FDD;&#x5B58;&#x4F5C;&#x7528;&#x57DF;">1.4 &#x4FDD;&#x5B58;&#x4F5C;&#x7528;&#x57DF;</h3>
<ul>
<li><p>&#x4FDD;&#x5B58;&#x4F5C;&#x7528;&#x57DF;&#x662F;&#x4E00;&#x79CD;&#x66F4;&#x9AD8;&#x7EA7;&#x7684;&#x95ED;&#x5305;&#x6280;&#x672F;&#xFF0C;&#x5982;&#x679C;&#x51FD;&#x6570;&#x5D4C;&#x5957;&#x51FD;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x5185;&#x90E8;&#x7684;&#x90A3;&#x4E2A;&#x51FD;&#x6570;&#x5C06;&#x5F62;&#x6210;&#x4F5C;&#x7528;&#x57DF;&#x95ED;&#x5305;&#x3002;&#x7B80;&#x5355;&#x7684;&#x8BF4;&#xFF0C;&#x8FD9;&#x79CD;&#x95ED;&#x5305;&#x80FD;&#x591F;&#x8FBE;&#x5230;&#x7684;&#x597D;&#x5904;&#x5C31;&#x662F;&#x8BA9;&#x6307;&#x4EE4;&#x80FD;&#x591F;&#x7ED1;&#x5B9A;&#x4E00;&#x4E9B;&#x5168;&#x5C40;&#x6570;&#x636E;&#x53BB;&#x8FD0;&#x884C;&#xFF1B;</p>
</li>
<li><p><strong>&#x57FA;&#x672C;&#x7ED3;&#x6784;&#xFF1A;</strong></p>
</li>
</ul>
<pre><code>     var A=function(){
         return function(){};
     }
</code></pre><ul>
<li><p><strong>&#x4F18;&#x70B9;&#xFF1A;</strong></p>
<ul>
<li><p>&#x5168;&#x5C40;&#x6570;&#x636E;&#x9690;&#x85CF;&#x5316;</p>
</li>
<li><p>&#x53EF;&#x4EE5;&#x8BA9;&#x67D0;&#x4E2A;&#x6307;&#x4EE4;&#x8FD0;&#x884C;&#x65F6;&#x5019;&#x7ED1;&#x5B9A;&#x4E00;&#x4E9B;&#x9690;&#x85CF;&#x7684;&#x5168;&#x5C40;&#x6570;&#x636E;&#x5728;&#x8EAB;&#x4E0A;&#x3002;</p>
</li>
</ul>
</li>
</ul>
<ul>
<li><strong>&#x4E00;&#x53E5;&#x8BDD;&#xFF1A; &#x5C06;&#x6570;&#x636E;&#x7ED1;&#x5B9A;&#x5728;&#x6307;&#x4EE4;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x8BA9;&#x6307;&#x4EE4;&#x4E0D;&#x518D;&#x4F9D;&#x8D56;&#x5168;&#x5C40;&#x6570;&#x636E;&#x3002;</strong></li>
</ul>
<h3 id="&#x4E8C;&#x3001;&#x9762;&#x5411;&#x5BF9;&#x8C61;">&#x4E8C;&#x3001;&#x9762;&#x5411;&#x5BF9;&#x8C61;</h3>
<pre><code>
&#x5BF9;&#x8C61;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;
&#x5BF9;&#x8C61;&#x5C31;&#x662F;&#x5E26;&#x6709;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF01;
</code></pre><p>&#x4EFB;&#x4F55;&#x4E00;&#x95E8;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x90FD;&#x8981;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#xFF0C;JavaScript&#x5219;&#x662F;&#x57FA;&#x4E8E;&#x539F;&#x578B;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BED;&#x8A00;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x601D;&#x7EF4;&#x8981;&#x7531;<strong>&#x9762;&#x5411;&#x8FC7;&#x7A0B;</strong>&#x8F6C;&#x5411;<strong>&#x9762;&#x5411;&#x5BF9;&#x8C61;</strong>&#xFF1A;</p>
<p><img src="assets/Snip20161217_2.png" alt=""></p>
<p><strong>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#xFF1A;</strong></p>
<p>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x91CC;&#x9762;&#xFF1A;&#x7C7B;&#x548C;&#x5BF9;&#x8C61;</p>
<p>&#x7C7B;&#x662F;&#x5BF9;&#x8C61;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x800C;&#x5BF9;&#x8C61;&#x662F;&#x7C7B;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x4F8B;</p>
<p>&#x4E00;&#x5207;&#x4E8B;&#x7269;&#x7686;&#x5BF9;&#x8C61; JavaScript &#x4E00;&#x5207;&#x7686;&#x5BF9;&#x8C61;</p>
<pre><code>
 &#x7C7B; &#x548C; &#x5BF9;&#x8C61;

 &#x5BF9;&#x8C61; &#x5973;&#x670B;&#x53CB;
 &#x5C0F;&#x767D; &#x4F60;&#x6709;&#x5BF9;&#x8C61;&#x4E86;&#x5417;&#xFF1F; &#x6CDB;&#x6307; &#x5973;&#x670B;&#x53CB;
 &#x6628;&#x5929;&#x966A;&#x4F60;&#x6253;LOL&#x7684;&#x90A3;&#x4E2A;&#x5973;&#x751F;&#x662F;&#x4F60;&#x5BF9;&#x8C61;&#x5417;&#xFF1F; &#x7279;&#x6307; &#x67D0;&#x4E00;&#x4E2A;&#x5973;&#x670B;&#x53CB;

 &#x5728;&#x5EA7;&#x7684;&#x6709;&#x559C;&#x6B22;&#x5403;&#x9999;&#x8549;&#x7684;&#x5417;&#xFF1F;
 &#x4F60;&#x624B;&#x4E2D;&#x90A3;&#x6839;&#x9999;&#x8549;&#x719F;&#x4E86;&#x5417;&#xFF1F; &#x7279;&#x6307;&#x5BF9;&#x8C61;&#xFF08;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x4F8B;&#xFF09;
</code></pre><p><strong>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7279;&#x6027;&#xFF1A;</strong></p>
<ul>
<li><p>&#x62BD;&#x8C61;</p>
</li>
<li><ul>
<li>&#x62BD;&#x8C61;&#x5C31;&#x662F;&#x5FFD;&#x7565;&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#x4E2D;&#x4E0E;&#x5F53;&#x524D;&#x76EE;&#x6807;&#x65E0;&#x5173;&#x7684;&#x90A3;&#x4E9B;&#x65B9;&#x9762;&#xFF0C;&#x4EE5;&#x4FBF;&#x66F4;&#x5145;&#x5206;&#x5730;&#x6CE8;&#x610F;&#x4E0E;&#x5F53;&#x524D;&#x76EE;&#x6807;&#x6709;&#x5173;&#x7684;&#x65B9;&#x9762;&#x3002;</li>
</ul>
</li>
</ul>
<ul>
<li><p>&#x5C01;&#x88C5;</p>
</li>
<li><ul>
<li>&#x5C01;&#x88C5;&#x662F;&#x628A;&#x8FC7;&#x7A0B;&#x548C;&#x6570;&#x636E;&#x5C01;&#x95ED;&#x8D77;&#x6765;&#xFF0C;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x8BBF;&#x95EE;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x5F00;&#x653E;&#x7684;&#x63A5;&#x53E3;&#x3002;</li>
</ul>
</li>
</ul>
<ul>
<li><p>&#x7EE7;&#x627F;</p>
<ul>
<li>&#x5B50;&#x7C7B;&#x5BF9;&#x8C61;&#x7EE7;&#x627F;&#x4F7F;&#x7528;&#x7236;&#x7C7B;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#x3002;</li>
</ul>
</li>
<li><p>&#x591A;&#x6001;</p>
</li>
<li><ul>
<li>&#x591A;&#x6001;&#x662F;&#x6307;&#x4E24;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5C5E;&#x4E8E;&#x4E0D;&#x540C;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5BF9;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#xFF08;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#xFF09;&#x4F5C;&#x51FA;&#x4E0D;&#x540C;&#x54CD;&#x5E94;&#x7684;&#x65B9;&#x5F0F;&#x3002;</li>
</ul>
<p><img src="assets/Snip20161220_5.png" alt=""></p>
</li>
</ul>
<h3 id="21--&#x6784;&#x9020;&#x51FD;&#x6570;">2.1  &#x6784;&#x9020;&#x51FD;&#x6570;</h3>
<blockquote>
<p>&#x6240;&#x6709;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6709;&#x4E00;&#x4E2A;&#x7279;&#x70B9;&#xFF1A;&#x9996;&#x5B57;&#x6BCD;&#x5927;&#x5199;&#xFF1B;</p>
<p>&#x5728;js&#x4E2D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x53EA;&#x8981;&#x6267;&#x884C;&#x4EE5;&#x540E;&#x80FD;&#x591F;&#x8FD4;&#x56DE;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x51FD;&#x6570;&#x5C31;&#x662F;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3002;</p>
</blockquote>
<p>&#x6784;&#x9020;&#x51FD;&#x6570;&#x6280;&#x5DE7;&#x7684;&#x6700;&#x5927;&#x76EE;&#x7684;&#xFF1A;&#x521B;&#x9020;&#x5B8C;&#x5168;&#x72EC;&#x7ACB;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x4E92;&#x76F8;&#x4E4B;&#x95F4;&#x4E0D;&#x5F71;&#x54CD;&#x3002;</p>
<h3 id="22--&#x5173;&#x952E;&#x8BCD;new">2.2  &#x5173;&#x952E;&#x8BCD;new</h3>
<ul>
<li><p>&#x5C06;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x53D8;&#x6210;&#x5BF9;&#x8C61;&#x5E76;&#x8FD4;&#x56DE;</p>
</li>
<li><p>&#x5728;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x5185;&#x90E8;&#x5C06;this&#x6307;&#x5411;&#x51FD;&#x6570;&#x672C;&#x8EAB;&#x3002;</p>
</li>
<li><p>new&#x8FD9;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x5B9E;&#x9645;&#x4E0A;&#x80FD;&#x591F;&#x5C06;&#x4EFB;&#x4F55;&#x51FD;&#x6570;&#x76F4;&#x63A5;&#x53D8;&#x6210;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;&#x5B83;&#x53EA;&#x6709;&#x5728;&#x548C;&#x6784;&#x9020;&#x51FD;&#x6570;&#x914D;&#x5408;&#x7684;&#x65F6;&#x5019;&#x624D;&#x6709;&#x7528;&#xFF0C;&#x5B83;&#x76F8;&#x5F53;&#x4E8E;&#x53EF;&#x4EE5;&#x5316;&#x7B80;&#x6784;&#x9020;&#x51FD;&#x6570;&#x81EA;&#x5DF1;&#x521B;&#x9020;&#x5BF9;&#x8C61;&#x548C;&#x8FD4;&#x56DE;&#x5BF9;&#x8C61;&#x7684;&#x6B65;&#x9AA4;&#x3002;</p>
</li>
</ul>
<h3 id="23-&#x6784;&#x9020;&#x5668;constructor-&#x548C;-&#x539F;&#x578B;&#x5C5E;&#x6027;-prototype">2.3 &#x6784;&#x9020;&#x5668;(constructor) &#x548C; &#x539F;&#x578B;&#x5C5E;&#x6027; (prototype)</h3>
<p>&#x5728;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4E2D;&#x90FD;&#x6709;&#x6784;&#x9020;&#x5668;&#x548C;&#x539F;&#x578B;&#x5C5E;&#x6027;&#xFF0C;&#x5305;&#x62EC;&#x539F;&#x751F;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A; Date, Array&#x7B49;&#xFF1B;</p>
<ul>
<li><p><strong>constructor   &#x8FD4;&#x56DE;&#x5BF9;&#x521B;&#x5EFA;&#x6B64;&#x5BF9;&#x8C61;&#x7684; &#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x5F15;&#x7528;</strong></p>
</li>
<li><p><strong>prototype   &#x8BA9;&#x6211;&#x4EEC;&#x6709;&#x80FD;&#x529B;&#x5411;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;</strong></p>
<blockquote>
<p>prototype&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x4E00;&#x4E2A;&#x5171;&#x4EAB;&#x5E93;&#xFF1B;&#x5728;&#x8FD9;&#x4E2A;&#x5171;&#x4EAB;&#x5E93;&#x91CC;&#x9762;&#x5B58;&#x50A8;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x5C06;&#x6765;&#x90FD;&#x4F1A;&#x88AB;&#x6240;&#x6709;&#x7684;&#x65B0;&#x5BF9;&#x8C61;&#x516C;&#x7528;&#x3002; &#x8FD9;&#x6837;&#x5927;&#x5927;&#x964D;&#x4F4E;&#x4E86;&#x521B;&#x5EFA;&#x65B9;&#x6CD5;&#x7684;&#x6210;&#x672C;&#x3002;</p>
</blockquote>
</li>
</ul>
<ul>
<li><p><strong>&#x539F;&#x578B;&#x5171;&#x4EAB;&#x5E93;&#x662F;&#x8C01;&#x4F7F;&#x7528;&#x7684;&#xFF1F;</strong></p>
<ul>
<li>&#x6784;&#x9020;&#x51FD;&#x6570;&#x4F7F;&#x7528;&#x539F;&#x578B;&#x5E93;&#xFF0C;&#x6240;&#x6709;&#x5C06;&#x6765;&#x7684;&#x5BF9;&#x8C61;&#x5171;&#x4EAB;&#x8FD9;&#x4E2A;&#x539F;&#x578B;&#x5E93;&#x3002; </li>
<li>&#x5982;&#x679C;&#x628A;&#x65B9;&#x6CD5;&#x90FD;&#x5199;&#x5728;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x539F;&#x578B;&#x5E93;&#x91CC;&#x9762;&#xFF0C;&#x5C06;&#x6765;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x539F;&#x578B;&#x7EE7;&#x7EED;&#x62D3;&#x5C55;&#x3002; &#x3001;</li>
</ul>
</li>
</ul>
<ul>
<li><p><strong>&#x539F;&#x578B;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#xFF1F;</strong></p>
</li>
<li><ul>
<li>&#x5728;&#x7F51;&#x9875;&#x53D1;&#x5E03;&#x4EE5;&#x540E;&#xFF0C;&#x539F;&#x578B;&#x7684;&#x5DE5;&#x4F5C;&#x4F1A;&#x81EA;&#x52A8;&#x505A;&#x4EE5;&#x4E0B;&#x4E24;&#x4EF6;&#x4E8B;&#x60C5;&#xFF1A;</li>
</ul>
</li>
</ul>
<pre><code>    &#x7B2C;&#x4E00;&#xFF1A;&#x81EA;&#x52A8;&#x5C06;&#x539F;&#x578B;&#x5E93;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x90FD;&#x653E;&#x5728;&#x5C06;&#x6765;&#x7684;&#x5BF9;&#x8C61;&#x8EAB;&#x4E0A;&#xFF1B;
    &#x7B2C;&#x4E8C;&#xFF1A;&#x5982;&#x679C;&#x5171;&#x4EAB;&#x5E93;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x4F1A;&#x81EA;&#x52A8;&#x66F4;&#x65B0;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x3002;
</code></pre><ul>
<li><p><strong>&#x6CE8;&#x610F;&#xFF1A;</strong></p>
<ul>
<li><p>&#x5728;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x5199;&#x6CD5;&#x5F53;&#x4E2D;&#xFF0C;&#x539F;&#x578B;&#x7684;&#x5171;&#x4EAB;&#x5E93;&#x91CC;&#x9762;&#x6240;&#x6709;&#x7684;&#x65B9;&#x6CD5;&#x4E2D;&#x7684;this&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x90FD;&#x4F1A;&#x6307;&#x5411;&#x5C06;&#x6765;&#x7684;&#x5BF9;&#x8C61;&#x3002;</p>
</li>
<li><p>&#x53EA;&#x6709;&#x5728;&#x4E24;&#x4E2A;&#x60C5;&#x51B5;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E24;&#x4E2A;&#x60C5;&#x51B5;&#x4E00;&#x5B9A;&#x8981;&#x68C0;&#x67E5;&#x4F5C;&#x7528;&#x57DF;&#xFF1A;</p>
</li>
</ul>
</li>
</ul>
<pre><code>     &#x7B2C;&#x4E00;&#xFF1A;&#x5982;&#x679C;&#x5728;&#x4E8B;&#x4EF6;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#xFF0C;this&#x7684;&#x6307;&#x5411;&#x4F1A;&#x53D8;&#x6210;&#x4E8B;&#x4EF6;&#x6E90;&#x3002;
     &#x7B2C;&#x4E8C;&#xFF1A;&#x5982;&#x679C;&#x5728;&#x5B9A;&#x65F6;&#x5668;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#xFF0C;this&#x7684;&#x6307;&#x5411;&#x4F1A;&#x53D8;&#x6210;window&#x3002;
</code></pre><ul>
<li><strong>&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF1A;&#x5907;&#x4EFD;&#x6307;&#x9488; </strong></li>
</ul>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="./js进阶-第五天.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: js进阶-第五天"><i class="fa fa-angle-left"></i></a>
        
        
    </div>
</div>

        
<script src="gitbook/app.js"></script>

    
    <script src="gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"highlight":{},"search":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}};
    gitbook.start(config);
});
</script>

        
    </body>
    
</html>
